Autodesk.Navisworks.Api.Assignee
Represents a person/company/role that an item can be assigned to.

Autodesk.Navisworks.Api.Assignee.#ctor


Autodesk.Navisworks.Api.Assignee.#ctor(Autodesk.Navisworks.Api.Assignee)
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.Assignee.#ctor(System.String)


Autodesk.Navisworks.Api.Assignee.#ctor(System.String,System.String)


Autodesk.Navisworks.Api.Assignee.Assigned
Is this assignee assigned.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Assignee.DisplayName
Display name of the assignee.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Assignee.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Assignee.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Assignee.InternalId
Internal ID of the assignee.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Assignee.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Assignee.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Assignee.Unassign
Throws System.ObjectDisposedException:
Object has been Disposed